#+TITLE: Autotuning under Tight Budget Constraints:
#+TITLE: @@latex: \\@@
#+TITLE: A Design of Experiments Approach
#+AUTHOR:    \footnotesize \alert{Pedro Bruel}, Steven Quinito Masnada, Brice Videau, Arnaud Legrand, Jean-Marc Vincent, Alfredo Goldman
#+EMAIL:     phrb@ime.usp.br
#+DATE:      \scriptsize \today
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:2 num:t toc:t @:t \n:nil ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   tex:t latex:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:

#+STARTUP: beamer
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [10pt, compress, aspectratio=169, xcolor={table,usenames,dvipsnames}]
#+LATEX_HEADER: \mode<beamer>{\usetheme[numbering=fraction, progressbar=none, titleformat=smallcaps, sectionpage=none]{metropolis}}

#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

#+LATEX_HEADER: \usepackage{sourcecodepro}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage{array}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \usepackage[scale=2]{ccicons}
#+LATEX_HEADER: \usepackage{url}
#+LATEX_HEADER: \usepackage{relsize}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{bm}
#+LATEX_HEADER: \usepackage{wasysym}
#+LATEX_HEADER: \usepackage{ragged2e}
#+LATEX_HEADER: \usepackage{textcomp}
#+LATEX_HEADER: \usepackage{pgfplots}
#+LATEX_HEADER: \usepgfplotslibrary{dateplot}
#+LATEX_HEADER: \definecolor{Base}{HTML}{191F26}
# #+LATEX_HEADER: \definecolor{Accent}{HTML}{157FFF}
#+LATEX_HEADER: \definecolor{Accent}{HTML}{790700}
#+LATEX_HEADER: \setbeamercolor{alerted text}{fg=Accent}
#+LATEX_HEADER: \setbeamercolor{frametitle}{bg=Base}
#+LATEX_HEADER: \setbeamercolor{normal text}{bg=black!2,fg=Base}
*** Output                                                    :B_block:BMCOL:
    :PROPERTIES:
    :BEAMER_env: block
    :BEAMER_col: 0.4
    :END:

    #+LATEX: \vspace{-.2cm}
    #+LATEX: \scriptsize

    #+HEADER: :results output :session *R* :exports results
    #+BEGIN_SRC R
     output$design = t(output$design)
     output
    #+END_SRC

    #+RESULTS:
    #+begin_example
    $D
    [1] 0.5656854

    $A
    [1] 3.90625

    $Ge
    [1] 0.512

    $Dea
    [1] 0.386

    $design
        1    5    7    11   15
    x_1 "-2" " 2" "-1" "-2" " 2"
    x_2 "1"  "1"  "2"  "3"  "3"

    $rows
    [1]  1  5  7 11 15
    #+end_example


    #+LATEX: \normalsize
*** Computing \(\left(\bm{X}^{\intercal}\bm{X}\right)^{-1}\)     :B_block:BMCOL:
    :PROPERTIES:
    :BEAMER_env: block
    :BEAMER_col: 0.5
    :END:
    #+LATEX: \vspace{.2cm}

    A design $D_{n,2}$, with *2-level factors*, will have a \(3\times3\)
    *dispersion matrix*, if we assume *linear relationships* and no *factor
    interactions*:

    #+LATEX: \vspace{.2cm}

    #+HEADER: :results output :session *R* :exports none
    #+BEGIN_SRC R
    library(AlgDesign)
    #+END_SRC

    #+RESULTS:

    #+LATEX: \scriptsize

    #+HEADER: :results output :session *R* :exports code
    #+BEGIN_SRC R
    factorial <- gen.factorial(c(2, 2))
    model <- model.matrix(~., factorial)
    dispersion <- t(model) %*% model
    eigen(dispersion)$values
    #+END_SRC

    #+RESULTS:
    : [1] 4 4 4

    #+LATEX: \vspace{-.4cm}

    #+HEADER: :results output :session *R* :exports results
    #+BEGIN_SRC R
    dispersion
    eigen(dispersion)$values
    #+END_SRC

    #+RESULTS:
    :             (Intercept) X1 X2
    : (Intercept)           4  0  0
    : X1                    0  4  0
    : X2                    0  0  4
    : [1] 4 4 4

    #+LATEX: \normalsize

